In [21]:
import pandas as pd

In [22]:
users = pd.read_excel('users.xlsx', sheet_name="Users")
professions = pd.read_excel('users.xlsx', sheet_name="Professions")

In [23]:
users

   ID   Name  Age  PROFESSION_ID
0  50    Abe   19              1
1  40    Eba   91              5
2  30  Oraci   87              3
3  20  Icaro   32              2
4  10  Balta   46              1

In [24]:
professions

   ID  Profession
0   1     Teacher
1   2   Scientist
2   3    Engineer
3   4  Archictect
4   5     Student

In [36]:
usersprofessions = users.merge(professions, how='left', left_on='PROFESSION_ID', right_on='ID')
usersprofessions.rename(columns={'ID_x': 'ID'}, inplace=True)
usersprofessions.drop('ID_y', axis=1)

   ID   Name  Age  PROFESSION_ID Profession
0  50    Abe   19              1    Teacher
1  40    Eba   91              5    Student
2  30  Oraci   87              3   Engineer
3  20  Icaro   32              2  Scientist
4  10  Balta   46              1    Teacher